app/Controllers/Dosen.php

SELECT *
FROM `dosen`
---
    public function index()
    {
        $dosenModel = new DosenModel();
        $data['DataDosen'] = $dosenModel->findAll();