app/Models/dosenmodel.php

    public function addDosen($data)
    {
        return $this->insert($data);
---
INSERT INTO `dosen` (`kode_dosen`, `nama_dosen`, `nama_matkul`) VALUES ('DT-01', 'Sandi Sandori, M, Kom', 'Sistem Komputasi Awan')